[
    {
        "Date": "2024-12-20 15:51:23",
        "Theme": "Gymnastics Skills",
        "Warm-Up": "10 minutes of foam rolling and light kettlebell swings to prepare for gymnastics skills.",
        "Strength": "7 sets of 8 Front Squat increasing weight each set.",
        "WOD": "For Time: 6 Rounds of 16 Barbell Rows, 12 Front Squat, 15 Russian Twists, 19 Standard Burpee, 14 Box Jumps, 16 Jumping Lunges"
    },
    {
        "Date": "2024-12-20 15:51:46",
        "Theme": "Cardio Blast",
        "Warm-Up": "10 minutes of dynamic stretching and light cardio focusing on cardio blast.",
        "Strength": "7 sets of 8 Bench Press with short rest periods.",
        "WOD": "For Time: 5 Rounds of 14 Burpee, 17 Box Step-Ups, 11 Sumo Deadlift High Pull, 10 Back Squat, 15 Mountain Climbers, 18 Hang Snatch"
    },
    {
        "Date": "2024-12-20 15:55:41",
        "Theme": "Back & Core",
        "Warm-Up": "5 minutes of jump rope followed by mobility drills targeting back & core.",
        "Strength": "7 sets of 8 Front Squat focusing on form and control.",
        "WOD": "For Time: 5 Rounds of 15 Push-Up to T, 19 Hollow Rocks, 15 Plank, 14 Kettlebell Swing (American), 11 Strict Press, 19 Jumping Lunges"
    },
    {
        "Date": "2024-12-20 15:55:58",
        "Theme": "Olympic Lifting",
        "Warm-Up": "10 minutes of foam rolling and light kettlebell swings to prepare for olympic lifting.",
        "Strength": "7 sets of 5 Overhead Squat increasing weight each set.",
        "WOD": "For Time: 5 Rounds of 14 Hanging Leg Raises, 13 Kettlebell Swing (Russian), 20 Thruster, 17 Shrugs, 10 Air Squat, 20 Deadlift"
    },
    {
        "Date": "2024-12-20 15:56:54",
        "Theme": "Cardio Blast",
        "Warm-Up": "10 minutes of dynamic stretching and light foam rolling focusing on cardio blast.",
        "Strength": "7 sets of 7 Bench Press with short rest periods.",
        "WOD": "For Time: 7 Rounds of 12 Snatch, 16 Box Jumps, 19 Deadlift, 15 Run 1km, 16 Barbell Rows, 16 Plank"
    },
    {
        "Date": "2024-12-20 15:59:44",
        "Theme": "Cardio Blast",
        "Warm-Up": "5 minutes of jump rope followed by mobility drills targeting cardio blast.",
        "Strength": "6 sets of 5 Bench Press with short rest periods.",
        "WOD": "5 Rounds For Time of: 7 Mountain Climbers, 16 Bench Press, 10 Snatch, 9 Push-Up to T, 14 Burpee, 9 Run 1km"
    },
    {
        "Date": "2024-12-20 15:59:51",
        "Theme": "Full Body",
        "Warm-Up": "10 minutes of foam rolling and light kettlebell swings to prepare for full body.",
        "Strength": "5 sets of 5 Front Squat with short rest periods.",
        "WOD": "5 Rounds For Time of: 8 Bar-Facing Burpee, 8 Front Squat, 8 Lateral Raises, 14 Push Jerk, 17 Hip Extensions, 10 GHD Sit-Ups"
    },
    {
        "Date": "2024-12-20 15:59:54",
        "Theme": "Upper Body Strength",
        "Warm-Up": "5 minutes of jump rope followed by mobility drills targeting upper body strength.",
        "Strength": "4 sets of 5 Snatch at 85% 1RM.",
        "WOD": "5 Rounds For Time of: 17 Echo Bike, 10 Standard Rope Climb, 8 Thruster, 10 Snatch, 9 Jumping Lunges, 13 Bar-Facing Burpee"
    },
    {
        "Date": "2024-12-20 16:37:23",
        "Theme": "Leg Day",
        "Warm-Up": "5 minutes of jump rope followed by mobility drills targeting leg day.",
        "Strength": "5 sets of 7 Overhead Squat at 77% 1RM.",
        "WOD": "7 Rounds For Time of: 12 Back Squat, 15 Barbell Rows, 11 Knees-to-Elbow, 10 Bent-Over Rows, 16 Dumbbell Clean and Jerk, 18 Bench Press"
    },
    {
        "Date": "2024-12-20 17:40:45",
        "Theme": "Leg Day",
        "Warm-Up": "10 minutes of foam rolling and light kettlebell swings to prepare for leg day.",
        "Strength": "7 sets of 9 Overhead Squat focusing on form and control.",
        "WOD": "8 Rounds For Time of: 15 Plank, 9 Kipping Pull-Up, 13 Thrusters with Dumbbells, 15 Dumbbell Clean and Jerk, 18 Lunges, 11 Mountain Climbers"
    }
]